lautarovera/cese-eccosur-project/bsl/CryptoBootloader_1_00_00_01/firmware/MSP430FR59xx_69xx/Src/BSL_Device_File.h
/*! Disable the factory BSL (1: Disable, x: Enable) */
#define DISABLE_FACTORY_BSL     1
/*! Define base address of USCI used by UART */
#define UART_USCI_BASE          EUSCI_A0_BASE
/*! Define base address of USCI used by I2C */
#define I2C_USCI_BASE           EUSCI_B0_BASE
/*! MPU access after reset:
 *  BSL Area = RX,  Rest of Mem = RW
 */
#define MPU_MPUSAM_DEFAULT      (0x3353)
/*! MPU access when writing memory including BSL
 *  BSL Area = RWX, Rest of Mem = RW
 */
#define MPU_MPUSAM_OPENBSL      (0x3373)
/*! MPU access when jumping to application:
 *  BSL Area = RX, User Mem = RWX, Info = RW 
 */
#define MPU_MPUSAM_APP          (0x3757)
   

//
//Device Specific Definitions
//
/*! Address where BSL Interface type is stored (in TLV for FR5969) */
#define BSL_STATE_ADDR          0x1A42
/*! Address where BSL Interface Configuration is stored (in TLV for FR5969) */
#define BSL_CONFIG_ADDR         0x1A43

#define MASS_ERASE_DELAY        44000   // ~5.5ms
#define BSL_PASSWORD_START      0xFFE0  // Start address of BSL Password
#define INTERRUPT_VECTOR_START  0xFFC0
#define INTERRUPT_VECTOR_END    0xFFFD  // Don't include reset vector
#define SECURE_RAM_START        0x1C00
#define MAIN_MEM_START          0x4400
#ifdef __MSP430FR5969__
#define MAIN_MEM_END            0x14000
#elif defined __MSP430FR6989__
#define MAIN_MEM_END            0x24000
#else
    #error "Configuration not defined"
#endif



//******************************************************************************
// I2C Definitions and variables
//******************************************************************************
#if (I2C_USCI_BASE == EUSCI_B0_BASE)
    // I2C Pin configuration
    #define I2C_PORT_SEL0       P1SEL0              
    #define I2C_PORT_SEL1       P1SEL1              
    #define I2C_PORT_DIR        P1DIR1
    #define SDA                 BIT6                // SDA on P1.6 - UCB0SDA
    #define SCL                 BIT7                // SCL on P1.7 - UCB0SCL
#ifdef __MSP430FR5969__
    #define I2C_PORT_CONFIG()   {I2C_PORT_SEL0 &= ~(SDA + SCL);\
                                 I2C_PORT_SEL1 |= (SDA + SCL);}
#elif defined __MSP430FR6989__
    #define I2C_PORT_CONFIG()   {I2C_PORT_SEL0 |= (SDA + SCL);\
                                 I2C_PORT_SEL1 &= ~(SDA + SCL);}
#else
    #error "Configuration not defined"
#endif
    // I2C Registers
    #define I2C_UCZNCTL1        UCB0CTLW0
    #define I2C_UCZNCTL0        UCB0CTLW0
    #define I2C_UCZNI2COA       UCB0I2COA0
    #define I2C_UCZNIE          UCB0IE
    #define I2C_UCZIV           UCB0IV
    #define I2C_UCZRXBUF        UCB0RXBUF
    #define I2C_UCZTXBUF        UCB0TXBUF
#else
#error "Define Peripheral configuration"
#endif

//******************************************************************************
// UART Definitions and variables
//******************************************************************************

#if (UART_USCI_BASE == EUSCI_A0_BASE)
    // UART Pin configuration
    #define UART_PORT_SEL1      P2SEL1              
    #define UART_PORT_SEL0      P2SEL0              
    #define UART_PORT_DIR       P2DIR1
    #define UART_TX             BIT0                // TX on P2.0 - UCA0TXD
    #define UART_RX             BIT1                // RX on P2.1 - UCA0RXD
#ifdef __MSP430FR5969__
    #define UART_PORT_CONFIG()   {UART_PORT_SEL0 &= ~(UART_TX + UART_RX);\
                                 UART_PORT_SEL1 |= (UART_TX + UART_RX);}
#elif defined __MSP430FR6989__
    #define UART_PORT_CONFIG()   {UART_PORT_SEL0 |= (UART_TX + UART_RX);\
                                 UART_PORT_SEL1 &= ~(UART_TX + UART_RX);}
#else
    #error "Configuration not defined"
#endif
    // UART Registers
    #define UART_UCZNCTLW0      UCA0CTLW0
    #define UART_UCZNBRW        UCA0BRW
    #define UART_UCZNMCTLW      UCA0MCTLW
    #define UART_UCZNMCTLW_H    UCA0MCTLW_H
    #define UCZNTXBUF           UCA0TXBUF
    #define UCZNRXBUF           UCA0RXBUF
    #define UCZNIFG             UCA0IFG
#else
#error "Define Peripheral configuration"
#endif


// Define commands to use
/* Change the project configuration based on requirements:
   |----------------------------|-----------------------------------|
   | Project configuration      |      Commands                     |
   |----------------------------|-----------------------------------|
   | "FR5969_Crypto"            |     Crypto BSL Commands           |
   | "FR5969_StandardwCrypto"   |     Standard + Crypto commands    |
   |----------------------------|-----------------------------------|

    Optionally, define the commands in this file as follows:
     #define CRYPTO_COMMANDS          1   // 1 to enable, 0 to disable
     #define FULL_STANDARD_COMMANDS   1   // 1 to enable, 0 to disable
*/ 


// Commands supported when using CryptoBootloader
#if (CRYPTO_COMMANDS != 0)
#   define SUPPORTS_REBOOT_RESET
#   define SUPPORTS_RX_PROT_DATA_BLOCK
#   define SUPPORTS_RX_ENC_KEY
#   define SUPPORTS_MASS_ERASE
#   define SUPPORTS_TX_BSL_VERSION
#endif

// Standard Commands supported by the device
#if (FULL_STANDARD_COMMANDS != 0)
#   define SUPPORTS_MASS_ERASE
#   define SUPPORTS_TX_BSL_VERSION
#   define SUPPORTS_RX_DATA_BLOCK_FAST
#   define SUPPORTS_RX_PASSWORD
#   define SUPPORTS_LOAD_PC
#   define SUPPORTS_RX_DATA_BLOCK
#   define SUPPORTS_CRC_CHECK
#   define SUPPORTS_TX_DATA_BLOCK
#endif

#endif // __BSL_DEVICE_FILE_H
